# Запросите у пользователя: имя;возраст; город; любимые языки программирования через запятую.
# Необходимо:
# преобразовать возраст в число;
# преобразовать языки в список;
# удалить повторяющиеся языки
# сохранить информацию в словарь;
# вывести данные с использованием f-строки.


# name = input("Введите ваше имя: ")
# age = int(input("Введите ваш возраст: "))
langs_str = input("Введите любимые языки программирования через запятую: ")

langs = list(set(langs_str.replace(" ", "").split(",")))

langs.sort()

result = {
    # "name": name,
    # "age": age,
    "programming_languages": langs
}

print(f"""Имя : {result["name"]}
Возраст : {result["age"]}
Любимые языки программирования : {", ".join(result["programming_languages"])}
""")